{"content": "With so many Blue Ridge cabin rentals from which to choose, Rolling River Cabin is the envy of many cabin rentals in the area. Perched slightly uphill above the big waters of the Toccoa River and the Cherokee Indian Fish Trap, this gorgeous North Georgia cabin offers easy access to fishing, tubing, and guided wade trips with our favorite outfitter, Toccoa River Outfitters. A gentle hiking path down to the river's edge is perfect for outdoor exploration and river activities - trout fishing, canoeing, tubing, or kayaking. From your Georgia riverfront cabin, you can listen to the whitewater rapids below and breathe the fresh, clean mountain air right off your spacious covered porches - all three of them!  Wave to the passengers on the Blue Ridge Scenic Railway as the train slowly passes by during spring, summer, and autumn...both kids and adults love watching the train pass.  As the Toccoa River uniquely rolls along northward into Tennessee, Rolling River Cabin is located next door to The River's Edge. Within 1/2 mile A Rolling River Cabin is situated in close proximity to Fallen Timber Lodge, Riverview Lodge, and Outlaw Ridge, ideal for business retreats and family reunions. A Rolling River Cabin exudes luxury with so many amazing amenities along the Toccoa River. Discover a place where you can unwind, relax, and revel in serene North Georgia Mountain beauty along a pristine river that once was home to the Cherokee Indians.  All you have to bring are your personal items and food. We hope you will make this your home away from home.Rolling River Cabin is uniquely located just 15 minutes from Downtown Blue Ridge and 7 minutes to McCaysville, GA/Copperhill, TN as well as 30 minutes from the Ocoee Olympic Whitewater Center, making the area's Blue Ridge highlights easily accessible. For guests who would love to experience Blue Ridge to the fullest or for those who just want a quiet little getaway, Rolling River Cabin provides that special...With so many Blue Ridge cabin rentals from which to choose, Rolling River Cabin is the envy of many cabin rentals in the area. Perched slightly uphill above the big waters of the Toccoa River and the Cherokee Indian Fish Trap, this gorgeous North Georgia cabin offers easy access to fishing, tubing, and guided wade trips with our favorite outfitter, Toccoa River Outfitters. A gentle hiking path down to the river's edge is perfect for outdoor exploration and river activities - trout fishing, canoeing, tubing, or kayaking. From your Georgia riverfront cabin, you can listen to the whitewater rapids below and breathe the fresh, clean mountain air right off your spacious covered porches - all three of them!  Wave to the passengers on the Blue Ridge Scenic Railway as the train slowly passes by during spring, summer, and autumn...both kids and adults love watching the train pass.  As the Toccoa River uniquely rolls along northward into Tennessee, Rolling River Cabin is located next door to The River's Edge. Within 1/2 mile A Rolling River Cabin is situated in close proximity to Fallen Timber Lodge, Riverview Lodge, and Outlaw Ridge, ideal for business retreats and family reunions. A Rolling River Cabin exudes luxury with so many amazing amenities along the Toccoa River. Discover a place where you can unwind, relax, and revel in serene North Georgia Mountain beauty along a pristine river that once was home to the Cherokee Indians.  All you have to bring are your personal items and food. We hope you will make this your home away from home.Rolling River Cabin is uniquely located just 15 minutes from Downtown Blue Ridge and 7 minutes to McCaysville, GA/Copperhill, TN as well as 30 minutes from the Ocoee Olympic Whitewater Center, making the area's Blue Ridge highlights easily accessible. For guests who would love to experience Blue Ridge to the fullest or for those who just want a quiet little getaway, Rolling River Cabin provides that special mountain oasis you are looking for. Even though this Blue Ridge cabin is 4 bedrooms/3 baths and can accommodate 10 guests, it presents quite cozily for a couple or a small family. Beautifully appointed interiors and large spacious covered porches each with a wood-burning fireplace overlooking the rushing waters of the Toccoa River, you will experience peace and a contentment you constantly yearn for. Start your day sipping your coffee and watching the sun rise over the sparkling waters of the Toccoa River and the geese that love to perch on the Cherokee Indian Fish Trap. With so many things to do, you can start by a short hike down to the river's edge and set up a lawn chair to enjoy the rushing river. A favorite among kids is to take your tubes down and use a ski rope to tie up to the tree so you can float around in the river without traveling! If you want to \"travel\" down the river, enjoy a two-hour float into McCaysville's Horseshoe Bend Park depending on the water level. Since you're just less than 10 minutes away from the park, you can leave a car or go pick up your party. For the fishermen in your group, contact Toccoa River Outfitters and they will give you a wade or float trip of your dreams right from your cabin and the area. They know where all the honey spots are where the trout like to hide and your fishing efforts will be richly rewarded with that trophy rainbow trout or brownie. If you want to venture away from the cabin, the famous Mercier Orchards is just down the road towards Blue Ridge, as well as Bear Claw Vineyards where relaxation is fun! In historic Downtown Blue Ridge discover a great many specialty shops, bike rentals, galleries, wine bars, breweries, coffee shops, clothes shops, shoe shops, home decor shops, kitchen shops, antique shops - there is something for everyone packed in on Main Street and beyond! For the outdoor thrills the Ocooee Whitewater Center offers whitewater rafting as well as hiking trails and walk paths, another favorite local hangout. In the warm months, enjoy swimming by the big rocks and find deep swimming holes. After working up an appetite at the end of the day, enjoy many of Blue Ridge's popular restaurants, wine bars, or breweries where live music can be found, or come back to the cabin and enjoy preparing a special meal to share indoors, or dine al fresco with a river backdrop. Enjoy lively conversation in front of the wood-burning fireplace on the main deck, as well as on the terrace level by the hot tub. If a private tête-à-tête is what you desire, the top private porch with a cozy wood-burning fireplace is the ideal romantic spot. Challenge your family or friends to a friendly game of billiards on the terrace level and the hot tub is right out the door overlooking the river with a porch swing and wood-burning fireplace. Four luxurious bedrooms await you when it's time for rest. Each bedroom offers comfortable pillowtop mattresses and soft linens. With a sleeping loft on the top floor with two day beds and a large spacious bathroom, this is an ideal spot for kids who want to stay close to their parents. The main floor offers a Queen bedroom with a large bath shared by the floor. The terrace level offers two bedrooms shared by a large spacious bath. Restful repose is comfortable and refreshing so that you can wake up the next day and find another adventure to explore.MAIN LEVEL:Living Area - Fine Leather Furnishings, HDTV, stone wood-burning fireplace, magnificent viewsDining Area - Dining for up to 10 w/ extra chairs, open to Kitchen and Living AreaKitchen - Fully stocked kitchen, granite countertops, all major appliances including gas stove/convection oven, oils and spices as provided, Keurig, regular coffee maker and grinder, blender, toasterOutdoor Covered Deck - Al fresco dining for 10, 2 rockers, outdoor stone wood-burning fireplace overlooking Toccoa RiverBedroom #1 - Queen bedroom, dresser, fainting couch, access to outdoor covered porch w/ fireplace and rockersBathroom #1 - Full spacious bath, granite countertops, double vanities, claw-foot tubTOP LEVEL:Bedroom #2 - King Master Suite, dresser, TV, private balcony with 2 rockers, stone wood-burning fireplace overlooking Toccoa RiverSleeping Loft - Sleeping Loft with 2 daybeds, overlooks Living AreaBathroom #2 - Spacious full bath w/ Jetted tub/shower combo, slate tile, granite countertops, double vanitiesTERRACE LEVEL:Living Area - Billiards, TV, Library, leather furnishingsBedroom #3 - Queen bedBedroom #4 - Queen bed, access to covered outdoor porch with Hot Tub, stone wood-burning fireplace overlooking Toccoa River, rockersBathroom #3 - Full bath, granite countertops, double vanities, tub/shower combo, services both Bedrooms #3 and #4Outdoor Covered Porch - Porch Swing, Hot Tub, Stone wood-burning fireplace, Rockers overlooking Toccoa RiverLaundry Room - Washer/Dryer 4 bedrooms, 3 baths2 Dogs Allowed ~ Pet Fees Required ~ 35 lbs. and LessMaximum Occupancy 101 King, 3 Queens, and 2 Twins3 outdoor wood-burning fireplaces on each level overlooking the Toccoa RiverLarge wood-burning stone fireplace on main level living room4 TVs: Two 42\" color Flat Screen TVs with Surround Sound, DirectTV satellite with movie package, DVD/CD in living area and terrace level. Additional Standard TV in the King master bedroom. 32\" flat screen TV in Queen bed room on the main levelFully-equipped gourmet kitchen with dishwasher, gas stove/convection oven, side-by-side refrigerator with iceGranite countertops in kitchen and bathrooms with designer fixturesAll wood lodge interior with elegant and sophisticated furnishings throughoutAntique clawfoot tub surrounded by slate floor on main level12' x 42' covered porches for dining al fresco in front of a fireplace overlooking the Toccoa RiverPrivate covered deck with outdoor fireplace off King Master SuiteOutdoor dining table, lounge chairs, rocking chairs, porch swingHot TubGas GrillTrophy Trout Fishing w/ Guide From Your CabinToccoa River and mountain views from almost every roomPrivate hiking/walking path to the RiverBilliardsBook libraryWasher/dryer and detergentHVACCeiling fansStarter packs of personal soaps, paper towels, toilet paperFully furnished with all linensNo Smoking inside the cabin or on the porchesBusiness Retreats/Family Reunions: Next to The River's Edge; Nearby Fallen Timber Lodge, Riverview Lodge, Outlaw Ridge"}